---
type: NonContinuousRailInfo
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 11
tags: [revit-api, class]
---

# NonContinuousRailInfo

`Autodesk.Revit.DB.Architecture.NonContinuousRailInfo` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValidNonContinuousRailHeight | 2019 | `public bool IsValidNonContinuousRailHeight ( double height )` |
| Method | IsValidNonContinuousRailMaterial | 2019 | `public bool IsValidNonContinuousRailMaterial ( ElementId materialId )` |
| Method | IsValidNonContinuousRailName | 2019 | `public bool IsValidNonContinuousRailName ( string name )` |
| Method | IsValidNonContinuousRailProfile | 2019 | `public bool IsValidNonContinuousRailProfile ( ElementId profileId )` |
| Property | Height | 2019 | `public double Height { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaterialId | 2019 | `public ElementId MaterialId { get ; set ; }` |
| Property | Name | 2019 | `public string Name { get ; set ; }` |
| Property | Offset | 2019 | `public double Offset { get ; set ; }` |
| Property | ProfileId | 2019 | `public ElementId ProfileId { get ; set ; }` |